app/views/quests/_form.html.erb

    <%= f.label :speciality_id %><br />
    <%= f.collection_select :speciality_id, Specialty.all, :id, :name %>
---
SELECT "specialties".* FROM "specialties"