app/views/quests/_form.html.erb

SELECT "profiles".* FROM "profiles"
---
    <%= f.number_field :creator_id %>
<%= collection_select(:afsd, :id, Profile.all, :id, :nick, options ={:prompt => "-Select a payment"}, :class =>"profile") %>