app/views/quests/index.html.erb

  <tr>
    <td><img src="<%= Specialty.find_by_id(quest.speciality_id).picture %>"/></td>
---
SELECT "specialties".* FROM "specialties" WHERE "specialties"."id" = 5 LIMIT 1