app/views/quests/show.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 3 LIMIT 1
---
  <b>Creator:</b>
  <%= Profile.find_by_id(@quest.creator_id).nick %>

SELECT "specialties".* FROM "specialties" WHERE "specialties"."id" = 5 LIMIT 1
---
  <b>Speciality:</b>
  <%= Specialty.find_by_id(@quest.speciality_id).name %>