app/views/profiles/show.html.erb

SELECT "completed_quests".* FROM "completed_quests" WHERE "completed_quests"."profile_id" = 3
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "3"]]
SELECT COUNT(*) FROM "completed_quests" WHERE "completed_quests"."profile_id" IN (SELECT "profiles"."id" FROM "profiles" WHERE "profiles"."id" = 1)
---
  <b>Completed quests:</b>
  <%=
    CompletedQuest.where(:profile_id=>Profile.where(:id=>@profile.id)[0].id).count