app/views/sessions/new.html.erb

SELECT "users".* FROM "users" WHERE "users"."email" = 'antares_43@hotmail.com' LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 1]]
---
if session[:user_id] != nil
  User.find(session[:user_id]).email;

if Profile.where(:users_id=>User.find(session[:user_id]).id)[0]!=nil

SELECT "quest_masters".* FROM "quest_masters" WHERE "quest_masters"."profile_id" = 1
---

<% if QuestMaster.where(:profile_id=>User.find(session[:user_id]))[0]!=nil %>