app/views/quest_masters/_form.html.erb

SELECT "profiles".* FROM "profiles"
---
    <%= f.label :profile_id %><br />
    <%= f.collection_select :profile_id, Profile.all, :users_id, :nick %>

SELECT "specialties".* FROM "specialties"
---
    <%= f.label :speciality_id %><br />
    <%= f.collection_select :speciality_id, Specialty.all, :id, :name %>