app/views/quest_masters/index.html.erb

SELECT "quest_masters".* FROM "quest_masters"
---
  </tr>
<%if QuestMaster.count!=0%>

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 1 LIMIT 1
SELECT "specialties".* FROM "specialties" WHERE "specialties"."id" = 1 LIMIT 1
---
    <tr>
      <td><%= link_to Profile.find_by_id(quest_master.profile_id).nick , quest_master%></td>
      <td><img src="<%=Specialty.find_by_id(quest_master.speciality_id).picture%>" /></td>