app/views/quest_masters/show.html.erb

  <br/>
  <img src="<%=Profile.find_by_id(@quest_master.profile_id).picture%>" />
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 1 LIMIT 1

  <br/>
  <img src="<%=Specialty.find_by_id(@quest_master.speciality_id).picture%>" />
---
SELECT "specialties".* FROM "specialties" WHERE "specialties"."id" = 1 LIMIT 1