app/views/completed_quests/_form.html.erb

    <%= f.label :quest_id %><br />
    <%= f.collection_select :quest_id, Quest.all, :id, :name %>
---
SELECT "quests".* FROM "quests"

    <%= f.label :profile_id %><br />
    <%= f.collection_select :profile_id, Profile.all, :id, :nick %>
---
SELECT "profiles".* FROM "profiles"