app/views/completed_quests/index.html.erb

SELECT "quests".* FROM "quests" WHERE "quests"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 1]]
---
  <tr>
    <td><%= Quest.find(completed_quest.quest_id).name %></td>
    <td><%= Profile.find(completed_quest.reviewer_id).nick %></td>