app/controllers/completed_quests_controller.rb

  def index
    @completed_quests = CompletedQuest.all
---
SELECT "completed_quests".* FROM "completed_quests"

  def show
    @completed_quest = CompletedQuest.find(params[:id])
---
SELECT "completed_quests".* FROM "completed_quests" WHERE "completed_quests"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @completed_quest = CompletedQuest.new(params[:completed_quest])
    @completed_quest.reviewer_id=Profile.where(:users_id=>current_user.id)[0].id

    respond_to do |format|
      if @completed_quest.save
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."users_id" = 1
INSERT INTO "completed_quests" ("comment", "created_at", "experience_won", "kelo_won", "profile_id", "quest_id", "reviewer_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @completed_quest = CompletedQuest.find(params[:id])
    @completed_quest.destroy
---
SELECT "completed_quests".* FROM "completed_quests" WHERE "completed_quests"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "completed_quests" WHERE "completed_quests"."id" = $1  [["id", 1]]