app/controllers/profiles_controller.rb

  def index
    @profiles = Profile.all
---
SELECT "profiles".* FROM "profiles"

  def show
    @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "logo"]]

  def edit
    @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", "3"]]

  def create
    #@profile = Profile.new(params[:profile])
    @profile = Profile.new(params[:profile].merge(:users_id => current_user.id))
    if Profile.count==0
      @profile.id=1
    else
      @profile.id=Profile.all[Profile.count-1].id+1
    end
    respond_to do |format|
      if @profile.save
---
SELECT COUNT(*) FROM "profiles"
SELECT "profiles".* FROM "profiles" ORDER BY "profiles"."id" DESC LIMIT 1
INSERT INTO "profiles" ("created_at", "id", "nick", "picture", "real_name", "updated_at", "users_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", 2011-11-22 07:31:37 UTC], ["id", 21], ["nick", "tt"], ["picture", "ttt"], ["real_name", "t"], ["updated_at", 2011-11-22 07:31:37 UTC], ["users_id", 202]]

  def update
    @profile = Profile.find(params[:id])
    if @profile.users_id==current_user.id
      respond_to do |format|
        if @profile.update_attributes(params[:profile])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "profiles" SET "nick" = 'Turupawnn', "updated_at" = '2011-11-23 15:04:27.094206' WHERE "profiles"."id" = 3