app/controllers/quest_masters_controller.rb

SELECT "quest_masters".* FROM "quest_masters"
---
  def index
    @quest_masters = QuestMaster.all

SELECT "quest_masters".* FROM "quest_masters" WHERE "quest_masters"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @quest_master = QuestMaster.find(params[:id])

SELECT "quest_masters".* FROM "quest_masters" WHERE "quest_masters"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def edit
    @quest_master = QuestMaster.find(params[:id])

INSERT INTO "quest_masters" ("created_at", "level", "profile_id", "speciality_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 22 Nov 2011 05:44:44 UTC +00:00], ["level", 1], ["profile_id", 1], ["speciality_id", 1], ["updated_at", Tue, 22 Nov 2011 05:44:44 UTC +00:00]]
---
  def create
    @quest_master = QuestMaster.new(params[:quest_master])

    respond_to do |format|
      if @quest_master.save

SELECT "quest_masters".* FROM "quest_masters" WHERE "quest_masters"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "quest_masters" SET "level" = 1, "updated_at" = '2011-11-23 17:31:31.659863' WHERE "quest_masters"."id" = 2
---
  def update
    @quest_master = QuestMaster.find(params[:id])

    respond_to do |format|
      if @quest_master.update_attributes(params[:quest_master])

SELECT "quest_masters".* FROM "quest_masters" WHERE "quest_masters"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "quest_masters" WHERE "quest_masters"."id" = $1  [["id", 1]]
---
  def destroy
    @quest_master = QuestMaster.find(params[:id])
    @quest_master.destroy