app/controllers/quests_controller.rb

  def index
    @quests = Quest.all
---
SELECT "quests".* FROM "quests"

  def show
    @quest = Quest.find(params[:id])
---
SELECT "quests".* FROM "quests" WHERE "quests"."id" = $1 LIMIT 1  [["id", "2"]]

  def edit
    @quest = Quest.find(params[:id])
---
SELECT "quests".* FROM "quests" WHERE "quests"."id" = $1 LIMIT 1  [["id", "3"]]

  def create
    @quest = Quest.new(params[:quest])
    @quest.creator_id=Profile.where(:users_id=>current_user.id)[0].id
    respond_to do |format|
      if @quest.save
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."users_id" = 1
INSERT INTO "quests" ("created_at", "creator_id", "description", "experience", "kelo_description", "kelo_experience", "level", "name", "speciality_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @quest = Quest.find(params[:id])
---
SELECT "quests".* FROM "quests" WHERE "quests"."id" = $1 LIMIT 1  [["id", "3"]]

  def destroy
    @quest = Quest.find(params[:id])
    @quest.destroy
---
SELECT "quests".* FROM "quests" WHERE "quests"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "quests" WHERE "quests"."id" = $1  [["id", 2]]