app/controllers/users_controller.rb

SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users"
INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", 2011-11-22 07:07:46 UTC], ["email", "jorge"], ["password_digest", "$2a$10$SKBf4QPSTFTOiQ5xkXgvUerApQPD1INk/C/0q9PRQq49mMz2FYpr6"], ["updated_at", 2011-11-22 07:07:46 UTC]]
---
  def create
    @user = User.new(params[:user])
    if User.count==0
      @user.id=1
    else
      @user.id=User.all[User.count-1].id+1
    end
    if @user.save